/**
 * @file drv_bmi088.c
 * @brief BMI088 六轴 IMU 驱动实现
 *
 */

#include "drv_bmi088.h"

/* 加速度计灵敏度查找表：将原始值转换为 g，单位 g/LSB */
const float BMI088_AccSenTable[BMI088_ACC_RANGE_NUM] = {
    0.0008974358974f,  // ±3g 量程灵敏度
    0.00179443359375f, // ±6g 量程灵敏度
    0.0035888671875f,  // ±12g 量程灵敏度
    0.007177734375f,   // ±24g 量程灵敏度
};

/* 陀螺仪灵敏度查找表：将原始值转换为 rad/s，单位 rad/s/LSB */
const float BMI088_GyroSenTable[BMI088_GYRO_RANGE_NUM] = {
    0.00106526443603169529841533860381f,     // ±2000°/s 量程灵敏度
    0.00053263221801584764920766930190693f,  // ±1000°/s 量程灵敏度
    0.00026631610900792382460383465095346f,  // ±500°/s 量程灵敏度
    0.00013315805450396191230191732547673f,  // ±250°/s 量程灵敏度
    0.000066579027251980956150958662738366f, // ±125°/s 量程灵敏度
};